from time import sleep
import random

print("pásvord generátor")

volba1 = input("chces heslo (Y/N): ")
pismenka = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j',
    'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't',
    'u', 'v', 'w', 'x', 'y', 'z',
    'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J',
    'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T',
    'U', 'V', 'W', 'X', 'Y', 'Z',
    '0', '1', '2', '3', '4', '5', '6', '7', '8', '9',

    # Česká písmena
    'ě', 'š', 'č', 'ř', 'ž', 'ý', 'á', 'í', 'é', 'ú', 'ů',
    'Ě', 'Š', 'Č', 'Ř', 'Ž', 'Ý', 'Á', 'Í', 'É', 'Ú', 'Ů',

    # Běžné speciální znaky
    '!', '"', '#', '$', '%', '&', '/', '(', ')', '=',
    '?', '+', '-', '*', ':', ';', '<', '>', '.', ',',
    '@', '[', ']', '{', '}', '|', '^', '~', '`',
    '_', "'",

    # Bílé znaky

    # Méně běžné ASCII a Unicode znaky
    '§', '¤', '°', 'µ', '¶', '÷', '¬', '¦', '¿', '¡',
    '¹', '²', '³', '¼', '½', '¾',
    '†', '‡', '•', '…', '‰', '„', '“', '”',
    'Ω', 'π', '∆', '∞', '√', '≈', '≠', '≤', '≥',

    # Symboly měn
    '€', '£', '¥', '¢', '₩', '₽', '₹', '$''a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j',
    'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't',
    'u', 'v', 'w', 'x', 'y', 'z',
    'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J',
    'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T',
    'U', 'V', 'W', 'X', 'Y', 'Z',
    '0', '1', '2', '3', '4', '5', '6', '7', '8', '9',

    # Česká písmena
    'ě', 'š', 'č', 'ř', 'ž', 'ý', 'á', 'í', 'é', 'ú', 'ů',
    'Ě', 'Š', 'Č', 'Ř', 'Ž', 'Ý', 'Á', 'Í', 'É', 'Ú', 'Ů',

    # Běžné speciální znaky
    '!', '"', '#', '$', '%', '&', '/', '(', ')', '=',
    '?', '+', '-', '*', ':', ';', '<', '>', '.', ',',
    '@', '[', ']', '{', '}', '|', '^', '~', '`',
    '_', "'",

    # Bílé znaky

    # Méně běžné ASCII a Unicode znaky
    '§', '¤', '°', 'µ', '¶', '÷', '¬', '¦', '¿', '¡',
    '¹', '²', '³', '¼', '½', '¾',
    '†', '‡', '•', '…', '‰', '„', '“', '”',
    'Ω', 'π', '∆', '∞', '√', '≈', '≠', '≤', '≥',

    # Symboly měn
    '€', '£', '¥', '¢', '₩', '₽', '₹', '$''a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j',
    'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't',
    'u', 'v', 'w', 'x', 'y', 'z',
    'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J',
    'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T',
    'U', 'V', 'W', 'X', 'Y', 'Z',
    '0', '1', '2', '3', '4', '5', '6', '7', '8', '9',

    # Česká písmena
    'ě', 'š', 'č', 'ř', 'ž', 'ý', 'á', 'í', 'é', 'ú', 'ů',
    'Ě', 'Š', 'Č', 'Ř', 'Ž', 'Ý', 'Á', 'Í', 'É', 'Ú', 'Ů',

    # Běžné speciální znaky
    '!', '"', '#', '$', '%', '&', '/', '(', ')', '=',
    '?', '+', '-', '*', ':', ';', '<', '>', '.', ',',
    '@', '[', ']', '{', '}', '|', '^', '~', '`',
    '_', "'",

    # Bílé znaky

    # Méně běžné ASCII a Unicode znaky
    '§', '¤', '°', 'µ', '¶', '÷', '¬', '¦', '¿', '¡',
    '¹', '²', '³', '¼', '½', '¾',
    '†', '‡', '•', '…', '‰', '„', '“', '”',
    'Ω', 'π', '∆', '∞', '√', '≈', '≠', '≤', '≥',

    # Symboly měn
    '€', '£', '¥', '¢', '₩', '₽', '₹', '$']

def generace():
    print("ok")
    print()
    heslo = " "
    delka = int(input("jak chces dlouhe heslo: "))
    while delka >= 0:
        pismenko1 = random.choice(pismenka)
        heslo += pismenko1
        delka -= 1
    print("heslo je:" + heslo)
    print()
    input("chces heslo ulozit do souboru (Y/N): ")
    print("chacha tvuj nazor me nezajima")
    sleep(2)

    with open("heslo.txt", "w", encoding="utf-8") as soubor:
        soubor.write(heslo)

    print("ulozeno")
if volba1 == "y" or volba1 == "Y":
    generace()
elif volba1 == "n" or volba1 == "N":
    print("zab se vole")
    sleep(1)
    exit(1)
else:
    print("spatna volba retarde")